""" Напишите программу, удаляющую из текста все слова, содержащие ""абв"". """

""" word = 'Сначала я абв как абвпонял, а потом понял!'
find = 'абв'


def del_words(letters, del_text):
    letters = list(filter(lambda x: del_text not in x, letters.split()))
    return " ".join(letters)
print(del_words(word, find)) """

